app/Services/CreateLabMessageRecordPdf.php

    public function ia($mpdf)
    {
        $boardAuditor = BoardAuditor::find($this->board_auditor_id);
        $boardAuditorMsRecordInfo = $boardAuditor->boardAuditorMsRecordInfos->first();
---
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1
select * from `board_auditor_ms_record_infos` where `board_auditor_ms_record_infos`.`board_auditor_id` = 1841 and `board_auditor_ms_record_infos`.`board_auditor_id` is not null


        $auditorInformations = AuditorInformation::whereIn('id',$uniqueAuditorIds)->get();

        $certi_lab = CertiLab::find($boardAuditor->app_certi_lab_id);
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = 2029 limit 1

            }
        }

        $boardAuditorExpert = BoardAuditoExpert::where('board_auditor_id',$this->board_auditor_id)->first();
---
select * from `board_audito_experts` where `board_auditor_id` = 1841 limit 1

        $data->statusAuditorMap = $statusAuditorMap;


        $htmlLabMemorandumRequest = HtmlLabMemorandumPdfRequest::where('type',"ia")->first();
---
select * from `html_lab_memorandum_pdf_requests` where `type` = 'ia' limit 1




        $signer->signer_1 = MessageRecordTransaction::where('board_auditor_id', $this->board_auditor_id)->where('signature_id','Signature1')
        ->where('certificate_type',2)
        ->first();
        $signer->signer_2 = MessageRecordTransaction::where('board_auditor_id', $this->board_auditor_id)->where('signature_id','Signature2')
        ->where('certificate_type',2)
        ->first();
---
select * from `message_record_transactions` where `board_auditor_id` = 1841 and `signature_id` = 'Signature3' limit 1
select * from `message_record_transactions` where `board_auditor_id` = 1841 and `signature_id` = 'Signature4' limit 1

        $filePath = $attachPath .'/'. $fullFileName;
        if (Storage::disk('ftp')->exists($filePath)) {
            $storePath = $no  . '/' . $fullFileName;
            $boardAuditor = BoardAuditor::find($this->board_auditor_id)->update([
                'file' => $storePath,
                'file_client_name' => 'memorandum' . '_' . $no . '.pdf'
            ]);
---
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1
update `board_auditors` set `file` = 'CAL_68_003/67b17af8d265a_20250216_124320.pdf', `file_client_name` = 'memorandum_CAL_68_003.pdf', `updated_at` = '2025-02-16 12:43:21' where `id` = 1841