app/Http/Controllers/Certify/AuditorAssignmentController.php

update `message_record_transactions` set `approval` = 1, `updated_at` = '2025-02-16 12:43:10' where `id` = 354
select * from `message_record_transactions` where `message_record_transactions`.`id` = '354' limit 1
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1
---
    public function signDocument(Request $request)
    {

        MessageRecordTransaction::find($request->id)->update([
            'approval' => 1
        ]);

        $messageRecordTransaction = MessageRecordTransaction::find($request->id);

        if ($messageRecordTransaction->certificate_type == 2)
        {
            // LAB
            $messageRecordTransactions = MessageRecordTransaction::where('board_auditor_id',$messageRecordTransaction->board_auditor_id)
                    ->whereNotNull('signer_id')
                    ->where('certificate_type',2)
                    ->where('approval',0)
                    ->get();

            if($messageRecordTransactions->count() == 0){
                $board = BoardAuditor::find($messageRecordTransaction->board_auditor_id);