app/Http/Controllers/Certify/CheckCertificateLabController.php

      public function update_payin1(Request $request, $id)
      {

             $previousUrl = app('url')->previous();
             $find_cost_assessment  =  CostAssessment::findOrFail($id);
             $certi_lab  =  CertiLab::findOrFail($find_cost_assessment->app_certi_lab_id);
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = 2029 limit 1

    public function DataPayIn(Request $request,$id)
    {
            // dd($request->all);
            $arrContextOptions=array();
            $attach_path            =  $this->attach_path ;
            $find_cost_assessment   =  CostAssessment::findOrFail($id);  //  ตารางธรรรมเนียม
            $ao                     = new CostAssessment;
            // dd($find_cost_assessment);
            $config = HP::getConfig();
            $url  =   !empty($config->url_acc) ? $config->url_acc : url('');
    // try {



        if(!is_null($find_cost_assessment) && !is_null($find_cost_assessment->app_certi_lab_id)){

            $certi_lab = CertiLab::findOrFail($find_cost_assessment->app_certi_lab_id); // ตารางใบสมัคร
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = 2030 limit 1

    public function show(Check $cc)
    {
        // dd('helo');
        // $checking_list = [
        //     2 => 'อยู่ระหว่างการตรวจสอบ',
        //     3 => 'ขอเอกสารเพิ่มเติม',
        //     5 => 'ไม่ผ่านการตรวจสอบ',
        //     6 => 'ผ่านการตรวจสอบ',
        //     7 => 'รอชำระค่าธรรมเนียม',
        //     9 => 'รับคำขอ',
        // ];
        //การประมาณการค่าใช้จ่าย
        $Cost      = Cost::where('app_certi_lab_id',$cc->app_certi_lab_id)->orderByDesc('id')->first();
        $certi_lab = CertiLab::where('id',$cc->app_certi_lab_id)->first();
---
select * from `app_certi_labs` where `id` = 2029 limit 1

                $app_no =  $app_no.'-'.$appno[1].'-'.$appno[2];
            }
        }
        $history   = CertificateHistory::where('app_no',$cc->applicant->app_no)->orwhere('app_no',$app_no)->orderByDesc('id')->get();
---
select * from `certificate_history` where `app_no` = 'CAL-68-003' or `app_no` = 'RQ-LAB-68-003' order by `id` desc

    public function copyScopeLabFromAttachement($app)
    {
        $copiedScoped = null;
        $fileSection = null;

        if($app->lab_type == 3){
           $fileSection = "61";
        }else if($app->lab_type == 4){
           $fileSection = "62";
        }

        $latestRecord = CertiLabAttachAll::where('app_certi_lab_id', $app->id)
        ->where('file_section', $fileSection)
        ->orderBy('created_at', 'desc') // เรียงลำดับจากใหม่ไปเก่า
        ->first();
---
select * from `app_certi_lab_attach_all` where `app_certi_lab_id` = 2029 and `file_section` = '62' order by `created_at` desc limit 1

   public function check_pay_in_lab(Request $request)
   {

        $arrContextOptions = array();
        $lab_id =   $request->input('lab_id');
        $payin =   $request->input('payin');
        $id  =   $request->input('id');
        $certi_lab = CertiLab::findOrFail($lab_id);
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = '2029' limit 1