app/Helpers/Helper.php

   static function getExpertInfo($groupId, $auditorId)
    {

        $boardAuditorGroup = BoardAuditorGroup::find($groupId);
        $auditorInformation = AuditorInformation::find($auditorId);
        $statusAuditor= StatusAuditor::find($boardAuditorGroup->status_auditor_id);
---
select * from `board_auditor_groups` where `board_auditor_groups`.`id` = 4 limit 1
select * from `auditor_informations` where `auditor_informations`.`id` = 60 limit 1
select * from `bcertify_status_auditors` where `bcertify_status_auditors`.`id` = 6 limit 1