app/Models/Certify/Applicant/CertiLab.php

    public function paidPayIn1BoardAuditors()
    {
        $appCertiAssessmentIds = CostAssessment::where('app_certi_lab_id', $this->id)
            ->where('status_confirmed', 1)
            ->pluck('app_certi_assessment_id')
            ->toArray();

        if (!empty($appCertiAssessmentIds)) {
            $boardAuditorIds = Assessment::whereIn('id', $appCertiAssessmentIds)
                ->pluck('auditor_id')
                ->toArray();

            $boardAuditors = BoardAuditor::whereIn('id', $boardAuditorIds)->get();
---
select * from `board_auditors` where `id` in (1842)

    public function getBranchTitleAttribute() {
        $data = HP::getArrayFormSecondLevel($this->certi_test_scope->toArray(), 'branch_id');
        // $datas = DB::table('bcertify_test_branches')->whereIn('id', $data)->pluck('title')->toArray();
        $datas = [];
        foreach ($data as $key => $list) {
            $branches = DB::table('bcertify_test_branches')->where('id',$list)->first() ;
---
select * from `bcertify_test_branches` where `id` = 3 limit 1

    public function getClibrateBranchTitleAttribute() {
        $data = HP::getArrayFormSecondLevel($this->certi_lab_calibrate->toArray(), 'branch_id');
        // $datas = DB::table('bcertify_calibration_branches')->whereIn('id', $data)->pluck('title')->toArray();
        $datas = [];
        foreach ($data as $key => $list) {
            $branches = DB::table('bcertify_calibration_branches')->where('id',$list)->first() ;
---
select * from `bcertify_calibration_branches` where `id` = 23 limit 1

      public function certi_lab_calibrate_groupBy(){
        return $this->hasMany(CertifyLabCalibrate::class,'app_certi_lab_id')->groupBy('branch_id');
---
select * from `app_certify_lab_calibrates` where `app_certify_lab_calibrates`.`app_certi_lab_id` = 2029 and `app_certify_lab_calibrates`.`app_certi_lab_id` is not null

public function getCertiAuditorsStatusAttribute() {
    $data = HP::getArrayFormSecondLevel($this->certi_auditors_many->toArray(), 'id');
    $list = '';
    $datas = BoardAuditor::whereIn('id', $data)->pluck('status')->toArray();
---
select `status` from `board_auditors` where `id` in (1842, 1841)