app/Http/Controllers/BoardAuditorController.php

    public function create(Request $request)
    {
        // dd($request->all());
        // dd($request->current_url, $request->current_route);
        $model = str_slug('board-auditor','-');
        if(auth()->user()->can('add-'.$model)) {

        $status_auditor = array();
        foreach (StatusAuditor::where('kind',1)->orderbyRaw('CONVERT(title USING tis620)')->get() as $sa) {
            $status_auditor[$sa->id] = $sa->title;
        }

        $app_certi_lab_id = !empty($request->app_certi_lab_id) ?  $request->app_certi_lab_id : null;

         $app_certi_lab = [];

         if(in_array("28",auth()->user()->RoleListId) && auth()->user()->SetRolesAdminCertify() == "false" ){
            $check = CheckExaminer::where('user_id',auth()->user()->runrecno)->pluck('app_certi_lab_id'); // เช็คเจ้าหน้าที่ LAB
            if(count($check) > 0 ){
                $app_certi_lab = CertiLab::whereIn('id',$check)
                                            ->whereIn('status', [7,12])
                                            ->orderby('id','desc')
                                            ->pluck('app_no', 'id');
             }
         }else{
                $app_certi_lab = CertiLab::whereIn('status', [7,12])
                                            ->orderby('id','desc')
                                            ->pluck('app_no', 'id');
---
select * from `bcertify_status_auditors` where `kind` = 1 order by CONVERT(title USING tis620)
select `app_no`, `id` from `app_certi_labs` where `status` in (7, 12) order by `id` desc


        //    $signers = Signer::orderbyRaw('CONVERT(name USING tis620)')->pluck('name','id','position');
           $signers = Signer::all();
           $selectedCertiLab = CertiLab::find($app_certi_lab_id);
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = '2030' limit 1

    public function getAuditorFromStatus($id=null,$app_id=null) { // หา status

        $app = CertiLab::find($app_id);

         if (!$app) {
            return response()->json([
                'message' => 'Status Auditor not found.'
            ], 400);
        }
        if(!is_null($app->lab_type) && $app->lab_type == 3){
            $type = 4;
        }else{
            $type = 3;
        }
        $auditors = [];
        $name_th = [];
        $Auditor =  AuditorExpertise::where('type_of_assessment',$type) ->get();
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = '2029' limit 1
select * from `auditor_expertises` where `type_of_assessment` = 3

    public function DataCertiNo($id) {
        $app_no =  CertiLab::findOrFail($id);
        if(!is_null($app_no)){
            $cost = Cost::where('app_certi_lab_id',$app_no->id)->orderby('id','desc')->first();
            if(!is_null($cost)){
                $cost_item = $cost->items;
            }
        }
        $cost_details =  StatusAuditor::orderbyRaw('CONVERT(title USING tis620)')->pluck('title', 'id');
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = '2030' limit 1
select `title`, `id` from `bcertify_status_auditors` order by CONVERT(title USING tis620)

    public function store(Request $request)
    {
        // $data = $request->all(); // รับข้อมูลทั้งหมดจากฟอร์ม
        // ตรวจสอบว่ามี key 'group' และเป็น array
        // foreach ($data['group'] as $group) {
        //     echo "Category: " . $group['category'] . PHP_EOL;
        // }
    //    dd($request->all());
        $model = str_slug('board-auditor','-');
        if(auth()->user()->can('add-'.$model)) {
            $this->validate($request, [
                'app_certi_lab_id' => 'required|max:255',
                'no' => 'required|max:255',
                // 'other_attach' => 'required|file',
                'group' => 'required|array',
                'group.*.status' => 'required',
                'group.*.users' => 'required',
            ]);
            // dd($request->all());
            try {

                CertiLab::where('id',$request->app_certi_lab_id)->orderby('id','desc')->first()->update([
                    'scope_view_signer_id' => $request->select_user_id
                ]);
                $app = CertiLab::where('id',$request->app_certi_lab_id)->orderby('id','desc')->first();
---
select * from `app_certi_labs` where `id` = '2029' order by `id` desc limit 1
update `app_certi_labs` set `updated_at` = '2025-02-16 12:37:15', `scope_view_signer_id` = '174' where `id` = 2029

                            'message_record_status' =>  1
                         ];
                if ($baId = $this->savingBoard($input)) {
                     $board  =  BoardAuditor::findOrFail($baId);
---
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1

    public function saveSignature($request,$baId,$app)
    {
        BoardAuditorMsRecordInfo::where('board_auditor_id',$baId)->delete();
        BoardAuditor::find($baId)->update([
            'message_record_status' => 1
        ]);

        $check = MessageRecordTransaction::where('board_auditor_id',$baId)->get();
---
delete from `board_auditor_ms_record_infos` where `board_auditor_id` = 1841
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1
select * from `message_record_transactions` where `board_auditor_id` = 1841

            ]);
        }

        $board  =  BoardAuditor::findOrFail($baId);
---
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1

    public function storeGroup($baId, $groupInput) {
        $ba = BoardAuditor::findOrFail($baId);
        foreach ($ba->groups as $group) {
            $group->auditors()->delete();
            $group->delete();
        }

        foreach ($groupInput as $group) {
            $sa = StatusAuditor::find($group['status']);
---
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1
select * from `bcertify_status_auditors` where `bcertify_status_auditors`.`id` = '4' limit 1

    public function storeAuditor($groupId, $strAuditorIds) {
        $auditorIds = explode(";", $strAuditorIds);
        foreach ($auditorIds as $auditorId) {
            $ai = AuditorInformation::find($auditorId);
---
select * from `auditor_informations` where `auditor_informations`.`id` = '60' limit 1

    public function savingGroup($input) {
        $input['created_at'] = $input['updated_at'] = now();
        $id = BoardAuditorGroup::insertGetId($input);
---
insert into `board_auditor_groups` (`board_auditor_id`, `status_auditor_id`, `updated_at`, `created_at`) values (1841, 4, '2025-02-16 12:37:21', '2025-02-16 12:37:21')
insert into `board_auditors` (`app_certi_lab_id`, `certi_no`, `no`, `file`, `file_client_name`, `attach`, `attach_client_name`, `state`, `vehicle`, `created_by`, `step_id`, `auditor`, `message_record_status`, `updated_at`, `created_at`) values ('2029', 'CAL-68-003', 'เจนจิรา ลี', 'CAL_68_003/ITvD2mP0uk-date_time20250216_120215.jpg', 'e02e4064-d4f4-4fab-91f1-127dc4d86733.jpg', 'CAL_68_003/346E1NhYUp-date_time20250216_120216.jpg', 'e02e4064-d4f4-4fab-91f1-127dc4d86733.jpg', 1, 1, 294, 2, 'คณะที่ 1', 1, '2025-02-16 12:37:16', '2025-02-16 12:37:16')

    public function savingAuditor($input) {
        $input['created_at'] = $input['updated_at'] = now();
        $id = BoardAuditorInformation::insertGetId($input);
---
insert into `board_auditor_informations` (`group_id`, `auditor_id`, `updated_at`, `created_at`) values (6099, '60', '2025-02-16 12:37:21', '2025-02-16 12:37:21')

    public function edit(BoardAuditor $ba, CertiLab $app = null)
    {

        $messageRecordTransaction = MessageRecordTransaction::where('board_auditor_id',$ba->id)->first();
        $messageRecordTransactions = MessageRecordTransaction::where('board_auditor_id',$ba->id)->get();
        // dd($messageRecordTransactions);
        $model = str_slug('board-auditor','-');
        if(auth()->user()->can('edit-'.$model)) {
            $previousUrl = app('url')->previous();
            $status_auditor = array();
            foreach (StatusAuditor::orderbyRaw('CONVERT(title USING tis620)')->get() as $sa) {
---
select * from `message_record_transactions` where `board_auditor_id` = 1842 limit 1
select * from `bcertify_status_auditors` order by CONVERT(title USING tis620)

        public function   CertificateHistory($baId,$group) {
            $ao = new BoardAuditor;
            $ba = BoardAuditor::findOrFail($baId);
---
select * from `board_auditors` where `board_auditors`.`id` = 1841 limit 1

    public function CreateLabMessageRecord($id)
    {
        // สำหรับ admin และเจ้าหน้าที่ lab
        if (!in_array(auth()->user()->role, [6, 7, 11, 28])) {
            abort(403);
        }

        $boardAuditor = BoardAuditor::find($id);
---
select * from `board_auditors` where `board_auditors`.`id` = '1843' limit 1


        $auditorInformations = AuditorInformation::whereIn('id',$uniqueAuditorIds)->get();

        $certi_lab = CertiLab::find($boardAuditor->app_certi_lab_id);
---
select * from `app_certi_labs` where `app_certi_labs`.`id` = 2030 limit 1

            }
        }

        $boardAuditorExpert = BoardAuditoExpert::where('board_auditor_id',$id)->first();
---
select * from `board_audito_experts` where `board_auditor_id` = '1843' limit 1

    public function SaveLabMessageRecord(Request $request)
    {
         // สร้างและบันทึกข้อมูลโดยตรง
         $record = new BoardAuditorMsRecordInfo([
            'board_auditor_id' => $request->id,
            'header_text1' => $request->header_text1,
            'header_text2' => $request->header_text2,
            'header_text3' => $request->header_text3,
            'header_text4' => $request->header_text4,
            'body_text1'   => $request->body_text1,
            'body_text2'   => $request->body_text2,
        ]);


        // บันทึกลงฐานข้อมูล
        $record->save();

        BoardAuditor::find($request->id)->update([
            'message_record_status' => 2
        ]);
        $board  =  BoardAuditor::findOrFail($request->id);
---
insert into `board_auditor_ms_record_infos` (`board_auditor_id`, `header_text1`, `header_text2`, `header_text3`, `header_text4`, `body_text1`, `body_text2`, `updated_at`, `created_at`) values ('1842', 'สก รป.', '11', 'อก ๐๗๑๔/', '๑๖ กุมภาพันธ์ ๒๕๖๘', '12', '13', '2025-02-16 12:38:36', '2025-02-16 12:38:36')
update `board_auditors` set `updated_at` = '2025-02-16 12:38:36', `message_record_status` = 2 where `id` = 1842
select * from `board_auditors` where `board_auditors`.`id` = '1842' limit 1